Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDom_regdef.h
/** \brief Protocol Error Control Register ${i} */
typedef struct _Ifx_DOM_SCICTRL_PECON_Bits
{
    Ifx_UReg_32Bit PEEN:1;            /**< \brief [0:0] Protocol Error Enable - PEEN (rw) */
    Ifx_UReg_32Bit reserved_1:1;      /**< \brief [1:1] \internal Reserved */
    Ifx_UReg_32Bit SETPE:1;           /**< \brief [2:2] Set Protocol Error - SETPE (rwh) */
    Ifx_UReg_32Bit reserved_3:1;      /**< \brief [3:3] \internal Reserved */
    Ifx_UReg_32Bit PEACK:1;           /**< \brief [4:4] Protocol Error Acknowledge - PEACK (rwh) */
    Ifx_UReg_32Bit reserved_5:27;     /**< \brief [31:5] \internal Reserved */
} Ifx_DOM_SCICTRL_PECON_Bits;

/** \brief SCI ${i} Arbiter Priority Register */
typedef struct _Ifx_DOM_SCICTRL_PRIORITY_Bits
{
    Ifx_UReg_32Bit MCI_P0:1;          /**< \brief [0:0] MCI${n} Priority - MCI${n}_P (rw) */
    Ifx_UReg_32Bit MCI_P1:1;          /**< \brief [1:1] MCI${n} Priority - MCI${n}_P (rw) */
    Ifx_UReg_32Bit MCI_P2:1;          /**< \brief [2:2] MCI${n} Priority - MCI${n}_P (rw) */
    Ifx_UReg_32Bit MCI_P3:1;          /**< \brief [3:3] MCI${n} Priority - MCI${n}_P (rw) */
    Ifx_UReg_32Bit MCI_P4:1;          /**< \brief [4:4] MCI${n} Priority - MCI${n}_P (rw) */
    Ifx_UReg_32Bit MCI_P5:1;          /**< \brief [5:5] MCI${n} Priority - MCI${n}_P (rw) */
    Ifx_UReg_32Bit MCI_P6:1;          /**< \brief [6:6] MCI${n} Priority - MCI${n}_P (rw) */
    Ifx_UReg_32Bit MCI_P7:1;          /**< \brief [7:7] MCI${n} Priority - MCI${n}_P (rw) */
    Ifx_UReg_32Bit reserved_8:8;      /**< \brief [15:8] \internal Reserved */
    Ifx_UReg_32Bit HPRS:3;            /**< \brief [18:16] High Priority Round Share - HPRS (rw) */
    Ifx_UReg_32Bit reserved_19:13;    /**< \brief [31:19] \internal Reserved */
} Ifx_DOM_SCICTRL_PRIORITY_Bits;

/** \brief Transaction ID Enable Register */
typedef struct _Ifx_DOM_TIDEN_Bits
{
    Ifx_UReg_32Bit ENSCI0:1;          /**< \brief [0:0] E${n}able Transaction ID Error from SCIn - ENSCI${n} (rw) */
    Ifx_UReg_32Bit ENSCI1:1;          /**< \brief [1:1] E${n}able Transaction ID Error from SCIn - ENSCI${n} (rw) */
    Ifx_UReg_32Bit ENSCI2:1;          /**< \brief [2:2] E${n}able Transaction ID Error from SCIn - ENSCI${n} (rw) */
    Ifx_UReg_32Bit ENSCI3:1;          /**< \brief [3:3] E${n}able Transaction ID Error from SCIn - ENSCI${n} (rw) */
    Ifx_UReg_32Bit ENSCI4:1;          /**< \brief [4:4] E${n}able Transaction ID Error from SCIn - ENSCI${n} (rw) */
    Ifx_UReg_32Bit ENSCI5:1;          /**< \brief [5:5] E${n}able Transaction ID Error from SCIn - ENSCI${n} (rw) */
    Ifx_UReg_32Bit ENSCI6:1;          /**< \brief [6:6] E${n}able Transaction ID Error from SCIn - ENSCI${n} (rw) */
    Ifx_UReg_32Bit ENSCI7:1;          /**< \brief [7:7] E${n}able Transaction ID Error from SCIn - ENSCI${n} (rw) */
    Ifx_UReg_32Bit ENSCI8:1;          /**< \brief [8:8] E${n}able Transaction ID Error from SCIn - ENSCI${n} (rw) */
    Ifx_UReg_32Bit ENSCI9:1;          /**< \brief [9:9] E${n}able Transaction ID Error from SCIn - ENSCI${n} (rw) */
    Ifx_UReg_32Bit ENSCI10:1;         /**< \brief [10:10] E${n}able Transaction ID Error from SCIn - ENSCI${n} (rw) */
    Ifx_UReg_32Bit ENSCI11:1;         /**< \brief [11:11] E${n}able Transaction ID Error from SCIn - ENSCI${n} (rw) */
    Ifx_UReg_32Bit ENSCI12:1;         /**< \brief [12:12] E${n}able Transaction ID Error from SCIn - ENSCI${n} (rw) */
    Ifx_UReg_32Bit ENSCI13:1;         /**< \brief [13:13] E${n}able Transaction ID Error from SCIn - ENSCI${n} (rw) */
    Ifx_UReg_32Bit ENSCI14:1;         /**< \brief [14:14] E${n}able Transaction ID Error from SCIn - ENSCI${n} (rw) */
    Ifx_UReg_32Bit ENSCI15:1;         /**< \brief [15:15] E${n}able Transaction ID Error from SCIn - ENSCI${n} (rw) */
    Ifx_UReg_32Bit ENMCI0:1;          /**< \brief [16:16] E${n}able Transaction ID Error from MCIn - ENMCI${n} (rw) */
    Ifx_UReg_32Bit ENMCI1:1;          /**< \brief [17:17] E${n}able Transaction ID Error from MCIn - ENMCI${n} (rw) */
    Ifx_UReg_32Bit ENMCI2:1;          /**< \brief [18:18] E${n}able Transaction ID Error from MCIn - ENMCI${n} (rw) */
    Ifx_UReg_32Bit ENMCI3:1;          /**< \brief [19:19] E${n}able Transaction ID Error from MCIn - ENMCI${n} (rw) */
    Ifx_UReg_32Bit ENMCI4:1;          /**< \brief [20:20] E${n}able Transaction ID Error from MCIn - ENMCI${n} (rw) */
    Ifx_UReg_32Bit ENMCI5:1;          /**< \brief [21:21] E${n}able Transaction ID Error from MCIn - ENMCI${n} (rw) */
    Ifx_UReg_32Bit ENMCI6:1;          /**< \brief [22:22] E${n}able Transaction ID Error from MCIn - ENMCI${n} (rw) */
    Ifx_UReg_32Bit ENMCI7:1;          /**< \brief [23:23] E${n}able Transaction ID Error from MCIn - ENMCI${n} (rw) */
    Ifx_UReg_32Bit reserved_24:8;     /**< \brief [31:24] \internal Reserved */
} Ifx_DOM_TIDEN_Bits;

/** \brief Transaction ID Status Register */
typedef struct _Ifx_DOM_TIDSTAT_Bits
{
    Ifx_UReg_32Bit TIDSCI0:1;         /**< \brief [0:0] Tra${n}saction ID Error from SCIn Status - TIDSCI${n} (rwh) */
    Ifx_UReg_32Bit TIDSCI1:1;         /**< \brief [1:1] Tra${n}saction ID Error from SCIn Status - TIDSCI${n} (rwh) */
    Ifx_UReg_32Bit TIDSCI2:1;         /**< \brief [2:2] Tra${n}saction ID Error from SCIn Status - TIDSCI${n} (rwh) */
    Ifx_UReg_32Bit TIDSCI3:1;         /**< \brief [3:3] Tra${n}saction ID Error from SCIn Status - TIDSCI${n} (rwh) */
    Ifx_UReg_32Bit TIDSCI4:1;         /**< \brief [4:4] Tra${n}saction ID Error from SCIn Status - TIDSCI${n} (rwh) */
    Ifx_UReg_32Bit TIDSCI5:1;         /**< \brief [5:5] Tra${n}saction ID Error from SCIn Status - TIDSCI${n} (rwh) */
    Ifx_UReg_32Bit TIDSCI6:1;         /**< \brief [6:6] Tra${n}saction ID Error from SCIn Status - TIDSCI${n} (rwh) */
    Ifx_UReg_32Bit TIDSCI7:1;         /**< \brief [7:7] Tra${n}saction ID Error from SCIn Status - TIDSCI${n} (rwh) */
    Ifx_UReg_32Bit TIDSCI8:1;         /**< \brief [8:8] Tra${n}saction ID Error from SCIn Status - TIDSCI${n} (rwh) */
    Ifx_UReg_32Bit TIDSCI9:1;         /**< \brief [9:9] Tra${n}saction ID Error from SCIn Status - TIDSCI${n} (rwh) */
    Ifx_UReg_32Bit TIDSCI10:1;        /**< \brief [10:10] Tra${n}saction ID Error from SCIn Status - TIDSCI${n} (rwh) */
    Ifx_UReg_32Bit TIDSCI11:1;        /**< \brief [11:11] Tra${n}saction ID Error from SCIn Status - TIDSCI${n} (rwh) */
    Ifx_UReg_32Bit TIDSCI12:1;        /**< \brief [12:12] Tra${n}saction ID Error from SCIn Status - TIDSCI${n} (rwh) */
    Ifx_UReg_32Bit TIDSCI13:1;        /**< \brief [13:13] Tra${n}saction ID Error from SCIn Status - TIDSCI${n} (rwh) */
    Ifx_UReg_32Bit TIDSCI14:1;        /**< \brief [14:14] Tra${n}saction ID Error from SCIn Status - TIDSCI${n} (rwh) */
    Ifx_UReg_32Bit TIDSCI15:1;        /**< \brief [15:15] Tra${n}saction ID Error from SCIn Status - TIDSCI${n} (rwh) */
    Ifx_UReg_32Bit TIDMCI0:1;         /**< \brief [16:16] Tra${n}saction ID Error from MCIn Status - TIDMCI${n} (rwh) */
    Ifx_UReg_32Bit TIDMCI1:1;         /**< \brief [17:17] Tra${n}saction ID Error from MCIn Status - TIDMCI${n} (rwh) */
    Ifx_UReg_32Bit TIDMCI2:1;         /**< \brief [18:18] Tra${n}saction ID Error from MCIn Status - TIDMCI${n} (rwh) */
    Ifx_UReg_32Bit TIDMCI3:1;         /**< \brief [19:19] Tra${n}saction ID Error from MCIn Status - TIDMCI${n} (rwh) */
    Ifx_UReg_32Bit TIDMCI4:1;         /**< \brief [20:20] Tra${n}saction ID Error from MCIn Status - TIDMCI${n} (rwh) */
    Ifx_UReg_32Bit TIDMCI5:1;         /**< \brief [21:21] Tra${n}saction ID Error from MCIn Status - TIDMCI${n} (rwh) */
    Ifx_UReg_32Bit TIDMCI6:1;         /**< \brief [22:22] Tra${n}saction ID Error from MCIn Status - TIDMCI${n} (rwh) */
    Ifx_UReg_32Bit TIDMCI7:1;         /**< \brief [23:23] Tra${n}saction ID Error from MCIn Status - TIDMCI${n} (rwh) */
    Ifx_UReg_32Bit reserved_24:8;     /**< \brief [31:24] \internal Reserved */
} Ifx_DOM_TIDSTAT_Bits;

/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_dom_union
 * \{   */
/** \brief Access Enable Register 0   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_DOM_ACCEN0_Bits B;            /**< \brief Bitfield access */
} Ifx_DOM_ACCEN0;

